[
  {
    "source": "code-of-conduct.md",
    "content": "Getting Started Getting started at 37signals involves a lot of little details, a number of big tasks, learning the details of your new job, meeting new coworkers, all while working remotely. Your teammates, your manager, your 37signals buddy, your Ops buddy, and our People team are all here to help as you navigate your first few days and weeks. Your First Few Days"
  },
  {
    "source": "code-of-conduct.md",
    "content": "Before you start, the People team will order you a new laptop with the specs you request and any accessories you need like an external keyboard, mouse, or display. Get what you need, while keeping in mind the demands of your work when choosing specs."
  },
  {
    "source": "code-of-conduct.md",
    "content": "A day or two before you start, your manager will email you instructions for your first day. Your manager will be your point of contact for your early projects and activities. You’ll also work with a member of our Ops team who will help you as you set up all the accounts you need to work at 37signals."
  },
  {
    "source": "code-of-conduct.md",
    "content": "On your first day, you’ll log into Basecamp to see a project dedicated to your onboarding called “Welcome, [your name]!”. Your welcome project will contain a few to-do lists, tailored to your role and linking to accounts or services that you need to set up. You’ll also see to-do lists that your Ops buddy and manager will be working through. Your Ops buddy and your manager will be in contact with you as you set up your environment, should you have questions or get stuck."
  },
  {
    "source": "code-of-conduct.md",
    "content": "To keep everyone's devices safe and secure, we manage all our Mac devices using Kandji as well as our in-house tool Shipshape 🔒. Your training schedules and onboarding expectations will be in your welcome project. You’ll also find docs with helpful links to technical documentation, walkthrough videos, important Basecamp projects, and more. Your welcome project will also contain a list of people to meet over the course of your first few weeks."
  },
  {
    "source": "code-of-conduct.md",
    "content": "* Your manager. You and your manager will meet on your first day to sort out a recurring 1:1 schedule and to review your specific onboarding expectations.\n* Your team. Most teams have a weekly call which you’ll join your first week.\n* Your 37signals buddy. Your buddy will be someone who’s not on your immediate team, who’s worked at 37signals for a while, and who can point you in the right direction when you have a question and don’t quite know where to turn. They’ll introduce themselves during your first week, to say hi and offer their help. They’ll check in with you periodically throughout your first couple months to see how you’re settling in.\n* People Ops. You’ll meet with Andrea to review 37signals policies, benefits, and compensation."
  },
  {
    "source": "code-of-conduct.md",
    "content": "After your environment has been set up, expectations are clear, and you’ve met who you need to meet, you’ll get to work! You’ll begin working on real projects, with plenty of support and guidance, within your first week. Your responsibilities and impact will increase as you learn and gain confidence over the next few months, and most people are up to speed and feeling fully part of the team in about 3 months."
  },
  {
    "source": "getting-started.md",
    "content": "How We Work Remotely 37signals is a fully distributed company. Our team works from all over the world, across 5 continents. We don't care where employees choose to live and work, just that they're here to do great work on exceptional products, alongside a world-class team. We’ve been remote since we started, and our founders literally wrote the book on the subject. You can work from anywhere, but please be sure to inform your People Ops team when you move – especially across state or country borders. It may affect your or the company’s tax situation. Cycles"
  },
  {
    "source": "getting-started.md",
    "content": "We work in 6-week cycles at 37signals. This fixed cadence serves to give us an internal sense of urgency, to keep projects from ballooning, and to provide us with a regular interval to make decisions about what we’re working on. Our cycle structure is particularly important for the product teams, since they approach feature and product development with scope and budget in mind up front. For more on this, all employees are encouraged to read Shape Up. All teams operate on the same 6-week cadence. Cooldown"
  },
  {
    "source": "getting-started.md",
    "content": "In between each cycle, we spend two weeks cooling down. That’s when product teams deal with bugs, when everyone writes up what they’ve worked on, and when teams decide what to tackle next. Sometimes big batch projects extend into cool down, but we try to avoid that. Communication Since we work asynchronously and remotely, it’s important to radiate information about what we’re working on. We have 4 chief mechanisms for doing that."
  },
  {
    "source": "getting-started.md",
    "content": "1. *What did you work on today?* You’ll be asked this question every afternoon, and you’re required to answer at least twice a week. You should describe what you’re working on and give some context about why you’re working on it or why it’s important.\n2. *What will you be working on this week?* You’ll be asked this question every Monday morning, and you’re required to answer every week."
  },
  {
    "source": "getting-started.md",
    "content": "Daily and weekly check-ins are subdivided by department so you’re only subscribed to your team’s answers. You’re of course free to subscribe to other team check-ins, but you’re not obligated to do so if you find it too noisy."
  },
  {
    "source": "getting-started.md",
    "content": "3. Every team submits a *Kickoff* for the upcoming cycle, and they’re due the second Friday of the cooldown period. Teams use their kickoff to summarize the work they have scheduled for the upcoming cycle.\n4. *Heartbeats* are required of every team, and they’re due on the first Friday of the cooldown period. Teams use their heartbeat to summarize and celebrate the work they completed during the previous cycle, and the work described in the cycle heartbeat should line up (more or less) with the work you scheduled in the cycle kickoff."
  },
  {
    "source": "getting-started.md",
    "content": "These 4 mechanisms work together to free individuals and teams to run their days and cycles with confidence and independence. We have six opportunities per year to make big decisions about what to work on, and the rest of the time should chiefly be spent carrying out those short-term plans. By having clear expectations for communication, it’s easier for everyone to build trust in where we’re going and why."
  },
  {
    "source": "getting-started.md",
    "content": "Heartbeats and Kickoffs are assigned to team leads well in advance of every cycle. Heartbeats, kickoffs, and automatic check-in answers can all be found in the What Works project for the current year. Asynchronously Most of the work you do at 37signals shouldn’t require you to be in constant communication throughout the entire day with someone."
  },
  {
    "source": "getting-started.md",
    "content": "You should collaborate as though most things you ask of others will get an answer eventually, but not necessarily right this second. Your first choice of action should be to post a message, a todo, or a document about what you need to explain or need to know. Then others can read it on their schedule, when the natural lulls of the day allow it, rather than being interrupted right in their peak flow time."
  },
  {
    "source": "getting-started.md",
    "content": "Of course there will be times when you do need to tightly collaborate with someone in real time, but those cases should be infrequent. We have pings, video calls, screen-sharing, or even in-person collaboration for when async isn’t efficient. With managers of one We rely on everyone at 37signals to do a lot of self-management. People who do this well are managers of one, and we expect everyone to embody this principle."
  },
  {
    "source": "getting-started.md",
    "content": "That means setting your own direction when one isn’t given; and determining what needs to be done, and doing it, without waiting for someone to tell you to. A manager of one will spend their time well when left to their own devices. There’s always more work to be done, always more initiatives to kick off, and always more improvement to be had. Balanced"
  },
  {
    "source": "getting-started.md",
    "content": "We limit ourselves to a 40-hour (32-hour in the summer) work week. Keeping our hours at work limited forces us to prioritize the work that really matters. A healthy amount of sleep and a rich and rewarding life outside of work should not be squandered for a few more hours at work. There are occasions when teams or individuals need to work off-hours for on-call, maintenance, or emergencies. This time should not be in addition to your normal working hours. Use your discretion to take time off to make up for the additional hours you put in during the week."
  },
  {
    "source": "how-we-work.md",
    "content": "Making a Career Your First Year Congratulations! You’re part of the team! In your first few weeks, you’ll get aligned with your manager and team on approach and expectations. You’ll get up and running, doing real work. It’s your manager’s responsibility to give you proper opportunities to demonstrate your skills and fit for the job. This includes your technical expertise, your engagement with coworkers, and your ability to take feedback and adapt to the 37signals culture. Similarly, it’s on you to take advantage of those opportunities and to show that you’re capable of meeting the team standards."
  },
  {
    "source": "how-we-work.md",
    "content": "When you start, you’ll receive an outline of expected performance metrics. Those standards will be clear and attainable, and your manager will give you frequent, candid feedback on how you're doing meeting them, as you go. You'll have formal performance reviews with your manager at the 3-, 6-, and 12-month marks. On occasion, despite our collective best efforts, it’s not a fit. We don’t do full-scale performance improvement plans during the first year. So if during that time it starts looking like your long-term employment won’t work out, your manager will let you know early and why."
  },
  {
    "source": "how-we-work.md",
    "content": "By the time you've reached your 1st anniversary with the company, we expect to be as excited about working with you as we were on day one. Likewise you should consider if you feel the same about having joined the team. When both of those answers are \"hell yeah!\", you'll move into a less frequent performance review cycle. Just once a year, around your anniversary of joining the company."
  },
  {
    "source": "how-we-work.md",
    "content": "Your first year with 37signals should confirm what we learned in the hiring phase — you’re well suited for this job, and you’re invigorated by the work to be done. Just put in your best effort, make sure you reach out if things aren’t feeling right, embrace the feedback you get from your manager, and openly share your feedback with them! Mastery & Titles"
  },
  {
    "source": "how-we-work.md",
    "content": "Advancing your career at 37signals doesn’t mean giving up on your craft. No matter your role, you can become better at the work itself and level up that way. This is especially important since we’re a relatively small company with few layers of managerial cake. Within each of our job functions, we’ve mapped our trajectory of mastery to five different levels. That title structure is shared amongst all departments, but the particulars of what characterizes one level from another will of course be different. \n* Junior (L1)\n* Mid-level (L2)\n* Senior (L3)\n* Lead (L4)\n* Principal (L5)"
  },
  {
    "source": "how-we-work.md",
    "content": "Mastery and internal leveling are assessed and determined during hiring."
  },
  {
    "source": "how-we-work.md",
    "content": "If you're hired at a level below Senior, you should work towards developing Senior level skills. Juniors should achieve Senior in 4 years (2 to Mid-level, 2 to Senior), and Mid-level contributors should achieve Senior in 2 years. When everyone is able to follow that trajectory, we create healthy, high-performing teams where everyone can trust each other to run at similar speeds. When people aren't able to level up within the above timeframes, after ample opportunities to do so, we usually determine that to be a bad long-term fit and we'll decide to part ways."
  },
  {
    "source": "how-we-work.md",
    "content": "Once you reach Senior, there is no expectation of further progression to Lead or Principal. In fact, most people will not achieve the Principal title! We see that level as reserved for people whose innovative work creates a resounding impact across the organization and even the industry. Those who do end up progressing all the way through our path usually have worked at 37signals for a decade or more. The proficiencies expected of all of our major teams by level are documented here: Designers, Ops, Programmers, QA, and Support. Pay & Promotions"
  },
  {
    "source": "how-we-work.md",
    "content": "37signals pays at the top 10% for our industry at San Francisco salary levels, regardless of where you live. The comparison data is provided by a company called Radford that polls compensation data from all the major companies in our industry and plenty of our smaller peers as well."
  },
  {
    "source": "how-we-work.md",
    "content": "Some jobs at 37signals are *not* matched to Radford comparison data. Compensation for common technical roles like programming and design is reliably competitive in a market like San Francisco. For some non-technical roles, compensation is much lower, and much less competitive. To compensate for that industry disparity, we instituted a $73,500 salary floor (floor adjusted for inflation since publishing)."
  },
  {
    "source": "how-we-work.md",
    "content": "The Radford data is reviewed once per year at the end of November. If it’s warranted, that is if the market rates in the top 10% have gone up, we’ll increase pay on January 1st to follow suit. We don’t decrease pay, even if the market rates may have dropped. If that happens, we’ll hold them steady until they come up again. Everyone in the same role at the same level is paid the same at 37signals."
  },
  {
    "source": "how-we-work.md",
    "content": "When you get a promotion, that is you move from one level to another, you’ll get a corresponding pay raise effective on your next pay cycle. Performance Reviews You’ll meet with your manager for formal performance reviews. When you’re new to 37signals, you’ll meet at the 3-month, 6-month, and 1-year marks. Then you’ll meet once a year, around your anniversary with the company. Your manager will share performance expectations for your role when you start, and they’ll keep you apprised of any changes to expectations should they evolve."
  },
  {
    "source": "how-we-work.md",
    "content": "Managers are expected to document performance review outcomes and any action items or deadlines that come out of the meetings. Performance Improvement Plans"
  },
  {
    "source": "how-we-work.md",
    "content": "If your work performance is not meeting expectations, you may be put on a Performance Improvement Plan (PIP). We only initiate PIPs if your manager’s concern is correctable in the short term. We do not initiate PIPs for fundamental performance issues that relate to your core job skills. If you’re a Programmer whose coding skills are not at the level they need to be, we’d forego a PIP. However, we may initiate a PIP to help you improve your performance in a coachable skill like project management."
  },
  {
    "source": "making-a-career.md",
    "content": "Managing work devices Everyone receives a new Mac when they join 37signals. We centrally manage and secure these devices with Kandji which reduces our exposure to security incidents. Kandji applies a standard configuration to every device (e.g. enable disk encryption, firewall, password rules), it installs essential apps (e.g. EncryptMe), and it will ensure the apps have the latest security updates applied. Kandji also allows us to remotely wipe devices should they be lost, or when an employee leaves the company. This doesn’t mean you are being monitored or tracked! Kandji is a configuration management system, not a panopticon."
  },
  {
    "source": "making-a-career.md",
    "content": "Access to code and secrets Knowing our devices are safe and secure allows us to entrust our work computers with access to sensitive systems like Queenbee, and our internal VPN and remote servers. This means installing the VPN, checking out 37signals code, and storing secrets must only be done on a managed work device, not a personal device."
  },
  {
    "source": "making-a-career.md",
    "content": "Please do not keep any personal data on your 37signals-issued laptop. You should maintain a separate, personally-owned machine if you need a home computer. The company reserves the right to and may be required to confiscate your laptop or its data at any point. Mobile devices, Windows and Linux"
  },
  {
    "source": "making-a-career.md",
    "content": "Devices running Android, iOS/iPadOS, Windows or Linux are currently unmanaged. It’s fine to install our BC4 and HEY apps on these devices to access work projects and email, but since they’re unmanaged – and therefore ‘untrusted’ – it’s not okay to store 37signals code or secrets on them. If you're coding or accessing secure systems, you should be doing so on a Kandji-managed Mac. FAQ There are many questions that arise from IT policies such as this, so we've written an FAQ in BC4 to help answer them."
  },
  {
    "source": "managing-work-devices.md",
    "content": "A Note About Moonlighting Moonlighting means working other professional, paid jobs outside of your work at 37signals. It’s not a black and white topic. There are one-time gigs, other pursuits, or opportunities that help you grow and make life interesting. We want to support that. But we want to make sure professional endeavors outside of 37signals don’t create conflicts of interest or affect your time, dedication, or performance at 37signals. So it’s a delicate balance. With that in mind, here are some examples of what we’d consider OK and what we would consider a conflict of interest and not OK:"
  },
  {
    "source": "managing-work-devices.md",
    "content": "OK"
  },
  {
    "source": "managing-work-devices.md",
    "content": "1. An occasional side gig, free or paid, for someone you know. For example, if you want to work on a friend’s website, or a design or writing project for something you’re involved with, that’s fine.\n2. An occasional speaking gig, free or paid. Someone’s going to pay you to give a talk somewhere? That’s fine as long as it doesn’t involve multiple days off for travel (unless you use your own personal vacation time against this travel time).\n3. A side business that’s different from your day job, as long as the commitment is only a few hours a week. If you come to work exhausted because you’re trying to start a full-time business on the side, it’s going to impact your performance here.\n4. Serve as an advisor for another company, or be on a board, as long as there’s no conflict of interest. The time commitment must be under a few hours a month. And if there’s a scheduling conflict, 37signals gets priority.\n5. Do volunteer or occasional pro-bono work for a cause you’re actively involved with. A little work here and there is fine, but, for example, becoming an organization’s full-time web designer and being on the hook to work during your standard work day, etc, would not be OK."
  },
  {
    "source": "managing-work-devices.md",
    "content": "Not OK"
  },
  {
    "source": "managing-work-devices.md",
    "content": "1. You can’t work full time or part time for another company in our industry. If you’re unclear about what our industry is, and you have a specific situation you’d like to talk about, ping Jason or David.\n2. Go out on a regular speaking circuit tour which is going to require multiple days of travel multiple times a year. That’s too disruptive to our own work schedule and to your fellow teammates.\n3. Consult for other companies in our industry where there may be a conflict of interest (a competitor, a product tangentially related to 37signals, etc).\n4. Be aggressive in marketing your availability for side work. If something comes to you through a friend or some connection, fine, but aggressively promoting something on the side will ultimately result in a conflict of interest here at work.\n5. Take on anything outside of work that’ll pull attention from work. For example, if you wanted to launch an app, but the app requires providing timely customer support to people who use the app, that’s going to eat into your day here at work. That would ultimately be a problem."
  },
  {
    "source": "managing-work-devices.md",
    "content": "In general Here are a few guiding principles about whether something could be a problem: * Is it competitive?\n* Does it occupy a disproportionate amount of your time?\n* Does it require you to be away during times when you’re needed at work?\n* Is it another paid gig that employs the same skills 37signals is paying you for? In general, we’d like to be lenient within reason, but we’re going to be strict if we see it impact your time, attention, or performance here at work."
  },
  {
    "source": "managing-work-devices.md",
    "content": "It’s hard to come up with one-size fits all rules. If you’re in doubt, please reach out to your manager."
  },
  {
    "source": "moonlighting.md",
    "content": "Our Internal Systems Besides the customer-facing applications, like the different versions of Basecamp, we have a number of internal systems that help us support, report, and operate the company. They are as follows: Dash Dash is the main hub for everything that has to do with logging (like finding why a request is slow or whether an email has been delivered), reporting (everything from number of support cases handled to split of devices used to access Basecamp), application health (response times, job queue exceptions etc). dash.37signals.com Queenbee"
  },
  {
    "source": "moonlighting.md",
    "content": "Queenbee is our invoice, accounting, and identity system. Here you can look up any customer account, see whether they are comped, refund an invoice, or even login as a customer. That’s an immense amount of power and we take its use very seriously. We only ever login as a customer after having been given explicit permission to do so, never preemptively. Our customers expect that their information is confidential, even from us, and we intend to honor that expectation at all times. billing.37signals.com The 37 command"
  },
  {
    "source": "moonlighting.md",
    "content": "This is perhaps less of a system and more of an interface to all our other systems. The 37 command gives easy access to the production consoles for all the applications, which is often needed when diagnosing or fixing custom issues. It also allows you to directly grep and tail log files for live debugging, amongst other things. github.com/basecamp/37 Sentry"
  },
  {
    "source": "moonlighting.md",
    "content": "We track programming exceptions on Sentry. When a customer hits a “Oops, something went wrong!” screen, that means there’ll be an entry in Sentry explaining to programmers why they saw that screen. Keeping the exceptions under control and monitored is primarily the responsibility of SIP and Jim via on-call. getsentry.com Kandji Kandji is how we make sure all work laptops are securely configured and running the latest software updates. It helps us reduce our exposure to security incidents. You can read more about this in Managing work devices. Shipshape"
  },
  {
    "source": "moonlighting.md",
    "content": "Shipshape is the OG in-house tool for ensuring your work laptop is safe and secure. We still run it, but it's gradually being superceded by Kandji. When you’re given access to the company’s GitHub account, you can run Shipshape to be sure you’re up to code. Shipshape will also test your machine periodically to let you know (and our SIP team know) if your machine springs a leak and needs bailing out. github.com/basecamp/shipshape"
  },
  {
    "source": "our-internal-systems.md",
    "content": "Our Rituals Meet-ups The entire company gathers in person twice a year. We meet up in a different city every time. In 2022, we traveled to Miami and Amsterdam. In 2023, Barcelona and New Orleans. Most of the planning is taken care of for you; you just need to book your flights. Lodging, meeting space, agenda, and social outings will be planned and communicated well in advance."
  },
  {
    "source": "our-internal-systems.md",
    "content": "There are some scheduled talks at every meet-up, like the All Hands session on Monday morning, lightning talks, and peer appreciation. Occasionally, we bring in outside speakers or trainers. Other than that, the meet-up is intentionally loosely structured. Teams huddle in a breakout room for a strategy session, groups go out for coffee or to explore the city, or managers meet 1:1s with employees."
  },
  {
    "source": "our-internal-systems.md",
    "content": "Meet-ups are 1 week long. Most people arrive Sunday, we meet Monday through Thursday, then travel home on Friday. Everyone should come to every meet-up, but skipping one here and there is okay if you have an engagement you can’t cancel. All Hands At the end of every cycle, we hold an All Hands meeting. Everyone at the company gathers on a Zoom call (or in person, at meetups) to hear about product development, business operations, new hires, and anything else that’s happened recently that’s worth sharing."
  },
  {
    "source": "our-internal-systems.md",
    "content": "Our COO runs the All Hands, but many people across departments may present on topics close to them during these meetings. Everyone on Support (EOS) Everyone in the company is encouraged to do periodic Customer Support shifts. We call it Everyone on Support (EOS). Talking directly to customers helps us realize what’s wrong and what’s right with our products. You’ll always have access to our wonderful Support team if you need help writing clear and correct answers to customer questions through Help Scout, our support response tool."
  },
  {
    "source": "our-rituals.md",
    "content": "Severance Packages If your employment or contract with 37signals is terminated, you may be eligible for a severance package. In most cases, if you've been with the company for less than 1 year, you'll be offered a lump sum payment equivalent to 4 weeks pay. If you've been with the company for over 1 year, you'll be offered an additional 2 weeks pay for every year of employment, with a maximum of 4 months of severance pay."
  },
  {
    "source": "our-rituals.md",
    "content": "The package will also include health insurance for you and your dependents if you’ve been on our policies for the same time periods, compensation for unused vacation time, and compensation for unused sabbatical time if applicable (1 year look back). Compensation for unused PTO is calculated using your hourly rate. In return, you’ll be asked for a general release of liabilities and other standard employment termination terms. If you're terminated for cause; such as misconduct, violation of company policies, insubordination or substance abuse while working, you will not be eligible for severance unless otherwise determined by management."
  },
  {
    "source": "severance.md",
    "content": "State Paid Family Leave Provisions Below are states that offer state-sponsored Paid Family Leave and in which 37signals has employees. If you work in one of the following states and contribute to these programs, you may qualify for leave. California Paid Family Leave"
  },
  {
    "source": "severance.md",
    "content": "* Residents of California may be eligible for continuous or intermittent leave to care for a child or family member. CA-PFL does not provide job protection, only monetary benefits.\n* Paid Family Leave for Bonding can be taken for up to 8 weeks within the first year of the birth of a new baby or the placement of an adopted or foster child.\n* Paid Family Leave for Caregivers may be taken for up to 8 weeks per year to care for a seriously ill or injured family member. Colorado Paid Family Leave"
  },
  {
    "source": "severance.md",
    "content": "* Residents of Colorado may be eligible for continuous or intermittent leave to care for themselves, a child, or other family member. CO-PFL provides job protection and monetary benefits.\n* Paid Family Leave for Bonding can be taken for up to 16 weeks within the first year of the birth of a new baby or the placement of an adopted or foster child.\n* Paid Family Leave for Family Care can be taken for up to 12 weeks per year to care for a seriously ill or injured family member.\n* Paid Family Leave for Self can be taken for up to 12 weeks per year to care for yourself during a serious illness or injury.\n* Paid Family Leave for Military Families can be taken for up to 12 weeks to manage arrangements when an immediate family member is called to active service in a foreign country.\n* Paid Family Leave for Safe Leave can be taken for up to 12 weeks per year to care for yourself or a family member after an incident of assault or domestic violence."
  },
  {
    "source": "severance.md",
    "content": "Oregon Paid Family Leave"
  },
  {
    "source": "severance.md",
    "content": "* Residents of Oregon may be eligible for continuous or intermittent leave to care for a child or family member. OR-PFL provides job protection and monetary benefits.\n* Paid Family Leave for caring for and bonding with a child can be taken for up to 14 weeks within the first year of the birth of a new baby or the placement of an adopted or foster child.\n* Paid Family Leave for Family Care can be taken for up to 12 weeks per year to care for a seriously ill or injured family member.\n* Paid Family Leave for Safe Leave can be taken for up to 12 weeks per year to care for yourself or your child after an incident of assault or domestic violence."
  },
  {
    "source": "stateFMLA.md",
    "content": "Titles for QA"
  },
  {
    "source": "stateFMLA.md",
    "content": "| Category | Senior QA Tester (L3) | Lead QA Tester (L4) |\n| ----- | ----- | ----- |\n| **Skill** |  |  |\n| *Mastery* | Demonstrates broad depth of knowledge of our products. Produces well-considered, high-quality QA reports beyond the happy path. Skilled in our entire testing toolset. | Intimate knowledge of our entire product suite. Acts as a subject matter expert on our QA approach, product features and shortcomings. Skilled in other testing disciplines such as accessibility, security or advanced tools (e.g. Litmus, Browser Stack, Test Rail) |\n| *Scope* | Consistent demonstration of applying the right balance of QA based on the scope and criticality of new features. Can assume responsibility for coordinating the testing work of third- party vendors. | Defines our QA approach and sets the standard for the team. Oversees all product QA across a cycle, including coordination of third-party testing firms. Ensures product pairings are considering all types of risks, including Security, Performance, and Accessibility as well as functional during development. Actively levels up less-experienced QA testers. |\n| *Technical* | Has a good understanding of our technical architecture as it relates to QA, providing technical insight when writing bug reports. Competence using browser dev tools. Runs apps locally, demonstrates good GitHub skills. | Broad understanding of our technical architecture across all platforms, as it relates to QA. Skilled in testing across multiple OSes: macOS, Windows, Linux, Android, iOS. Deep understanding of browser nuances and browser dev tools. Strong command of accessibility concerns and how these relate to CSS and Javascript. |\n| *Judgment* | Proactively identifies QA problems, knows when to raise bugs on our issues board vs On Call, and when to raise an incident. Pays attention to detail and can demonstrate testing pragmatism. | Demonstrates strong cultural alignment with 37signals doctrine when making decisions. Can identify judo opportunities during product development. Is consistently sought for advice across testing and accessibility disciplines. Proactively identifies issues relating to work quality of internal or external QA. |\n| **Engagement** |  |  |\n| *Ownership - Manager of One* | Oversees feature QA end-to-end. Logs bugs and issues, provides assistance as fixes make it through to production. | Coaches other testers on the quality and testing approach for major projects and initiatives. Defines and upholds our QA standards. Maintains our 'Top 5' lists, preventing overpopulation. Works with product and engineering leadership to assist progress with delivering these fixes. |\n| *Communication* | Writes high-quality bug reports. Trusted to provide well-written QA support and feedback throughout feature development. Provides feedback on the QA process, suggesting improvements in the interests of the company. Forges strong relationships with product programmers and designers. | Sets the standard for bug reporting. Defines QA standards, ensures they're upheld. Forges strong relationships with QA peers, and cross-department. Writes absorbing cycle Kickoffs and Heartbeats. Demonstrates project management best practices. Ensures leadership is kept informed, async, on QA progress. Celebrates team and individual achievements. |\n| *Prioritization* | Balances inbound work, paying attention to schedules and ensuring the right projects are QA'd at the right time. Prioritizes tasks and project work with little direction, minimising QA blockers for dev pairings. Works confidently and effectively, persists when faced with uncertainty or ambiguity but pulls in support when needed. Contributes to planning within the QA team. | Is organised and efficient. Closely collaborates with Product to triage and prioritise resolution of bugs / quick wins. Can plan entire cycles for a team. Can offer critical product insight drawn from extensive experience. Regularly challenges their team and discipline to help drive projects forward, makes process improvements year on year. |\n| *Trust* | Work is reviewed with some back and forth and the occasional need for material direction or implementation changes. Trusted to run QA end-to-end for product features that requires little or no oversight or correction. Makes material contributions to documentation. | Consistently sought by colleagues for assistance with QA, feature scope or issue severity decisions. Capable of directing the QA team strategy for an entire cycle. Oversees the work of third-party firms (testing, accessibility), providing feedback and ensuring appropriate quality. |\n| **Coachability** |  |  |\n| *Feedback* | Receives constructive feedback with a growth mindset. Has self-awareness about core strengths and areas for development. Provides specific, well-considered feedback within area of expertise, when asked. Is able to disagree and commit. | Seeks constructive feedback on own work with a growth mindset. Has self-awareness about core strengths and areas for development. Provides developing oversight to senior, mid, and junior QA testers. Can disagree and commit. |"
  },
  {
    "source": "titles-for-designers.md",
    "content": "Titles for Ops"
  },
  {
    "source": "titles-for-designers.md",
    "content": "| Category | Junior SRE (L1) | SRE (L2) | Senior SRE (L3) | Lead SRE (L4) | Principal SRE (L5) |\n| ----- | ----- | ----- | ----- | ----- | ----- |\n| **Skill** |  |  |  |  |  |\n| *Mastery* | Competent in 1-2 areas (e.g. networking, configuration management, containers, orchestration) and with common processes and procedures. | Proficient in one or more areas of expertise (e.g. networking, configuration management, containers, orchestration), and experienced with common processes and procedures. | Proficient in multiple areas of expertise (e.g. networking, configuration management, containers, orchestration), and fully understands common processes and procedures. | Expert in multiple areas. Leads the team and mentors others on common processes and procedures. | Has multiple, broad areas of expertise: configuration management, containers, continuous integration / development, debugging, orchestration, optimization, networking, performance, reliability, security. Makes what is new normal; what is old reliable; evangelize what is next. |\n| *Mastery* | Assists with performing work on production systems with help from more senior teammates. Performs low-risk maintenance with help. | Performs work on production systems by following existing procedures. Plans and performs low-risk maintenance independently. | Plans and performs maintenance independently. Participates in higher risk maintenances. | Performs complex work like capacity planning, load testing, and security improvements. Leads high-risk maintenance with limited to no customer impact. | Leads high-risk maintenance with limited to no customer impact. When a site is down, something is broken, or work is crazy, ready to save the day and lead us to a successful resolution. |\n| *Mastery* | Shadows on call shifts and assists with triaging on-call issues. | Participates in on call shifts with the backing of a more senior team member. Confidently handles or triages production issues. | Full participant in regular on-call shifts and confident in ability to handle or triage production issues. | Can lead the resolution of any problem. Significant technical contributor to problem resolution; demonstrates consistent maturity in communication and demeanor under stress. | Fully capable of leading critical incident response. Coordinates internal and external responses to major issues. Leads problem resolution via emergency procedures. |\n| *Tech and Tooling* | Uses our most common tools & systems in day to day work. | Familiar with all the major tools, systems, and documentation. | Subject matter expert in at least one of our major systems. | Subject matter expert on multiple systems. You help make strategic decisions around major components. | Leader on the team, technically and culturally. Manages critical, complex projects independently and capable of effectively delegating large subsections of work to your teammates. Spends considerable time helping others improve. |\n| *Scope* | Works independently on smaller projects. Shows strength in some areas of specialization, but lacks experience in all areas yet. | Works independently on small projects and is a reliable contributor to larger projects and resolving major problems. Shows strength in some areas of specialization, but lack experience in all areas yet. | Works independently on small projects and are a reliable contributor to larger projects and resolving major problems. | Elevates team and company standards through developing new tooling, processes, procedures, and effective communication. Carries out research, testing, implementation and improvement for new systems. | Elevates team and company standards through developing new tooling, processes, procedures, and effective communication. Carries out research, testing, implementation and improvement for new systems. You push the whole organization forward regularly through implementing new systems and designs. |\n| *Judgment* | Manages projects with help scoping and planning.Demonstrates curiosity in their discipline and seeks out advice from more senior teammates. | Scopes and manages small projects with minimal oversight and approval. Has a good sense for when to cut scope to deliver projects on time. Identifies and resolves problems, improves work they touch/leaves work in better shape. Pays attention to detail. | Scopes and manages large projects with minimal assistance. Experience is sought by peers for advice. Improves existing professional standards for the team. | Strong ability to set scope and manage critical projects with minimal oversight or approval. Defines professional standards. Is sought out for advice. | Able to apply agility and judo to even the most complex of deep technical work. Ensures that team's output is at the highest technical standards. A leader in ensuring robust and effective best practices are understood and followed across the organization. |\n| **Engagement** |  |  |  |  |  |\n| *Ownership - Manager of One* | Requires help setting a direction when assigned work. Asks questions when you need help, researches what's been done in the past and why, attempts to solve problems independently. | Set their own direction once assigned work. Asks questions but you don't need regular status checks. | Sets their own direction and works with little to no oversight or help. Conceptualizes new work to be done, steps to get there, and then executes the steps to complete it. | Capable of setting team direction. Skillfully manages projects and resources, requiring little to no redirection or input from leadership. | Fully capable of leading the most critical production incidents to successful resolution, coordinating company-wide responses and advising on public communications. |\n| *Communication* | Communicates well in team calls and check-ins, heartbeats, and kick-offs. | Attempts to unblock themselves but ask for help when needed. Communicates well within the team structure, sharing knowledge and bringing in more experienced teammates when needed. | Attempts to unblock themselves but ask for help when needed. Communicates well within the team structure, sharing knowledge and bringing in more experienced teammates when needed. | Acts as a representative to the company, weighing in on larger discussions and making recommendations. Rarely need help unblocking themselves, and acts as a resource for others. | Demonstrate project management and communication best practices. Ensures leadership is informed on team progress. Responsible for cycle planning. |\n| *Planning* | Plans individual tasks with little oversight. Can identify small pieces of work without having them assigned. Able to pitch small projects or improvements to the team and explain why it's important and should be prioritized. | Plans individual projects effectively with little oversight. Contributes to cycle planning. Identifies work without having it assigned and without asking others what's important. Able to pitch projects to the team and explain why it's important and should be prioritized. | Plans individual projects. Contributes to cycle planning. Identifies work without having it assigned and without asking others what's important. Able to pitch projects to the team and explain why it's important and should be prioritized. | Key contributor to cycle planning. Able to plan and execute large projects while keeping team and company strategy in mind. | Regularly challenges their team or discipline to help drive projects forward, to better deliver on team/discipline priorities. |\n| *Flexibility* | Has some points of view about technical solutions and best practices, but mostly observes and learns from the more senior members of your team. | Demonstrated willingness to express a viewpoint and opinion, and able to disagree and commit. | Demonstrated strong points of view about technical approaches and solutions that are rooted in experience. Willing to express a viewpoint and opinion, and also able to disagree and commit. | Strong points of view rooted in experience, technical expertise, and industry best practices. Expresses opinions confidently and effectively, and can balance your recommendations with the larger needs of the team. Able to disagree and commit. | Demonstrated ability to think through problems and devise and apply novel solutions that are outside the box. Able to disagree and commit. |\n| *Trust* | Contributes to small projects with direction and help. Work is reviewed. | Productive member of the team, able to contribute effectively to small projects. Work is reviewed with the occasional need for material direction or implementation changes. | Fully productive member of the team, able to contribute to almost any project. Work doesn’t necessarily need to be reviewed, but general approach may be. | Able to contribute to any project. Work happens completely autonomously with no regular need for review. Work is almost always free of mistakes, and you often help others improve the quality of their work. | Significant technical contributor to complex problem resolution; demonstrates consistent maturity in communication and demeanor under stress. |\n| **Coachability** |  |  |  |  |  |\n| *Feedback* | Actively seeks feedback. Receives feedback with a positive attitude, and applies corrective feedback. Hungry for growth & development. | Able to weigh in on larger discussions at the team level with helpful, relevant feedback. Receives feedback with a growth mindset. | Able to act as informal mentor, and provides helpful, direct, specific feedback to more junior teammates. | Capable of being a technical lead. Sought by colleagues on and off the team for help with critical work or decisions. Able to disagree and commit. | Capable of being a team lead to any size team. Sought by colleagues on and off the team for help with critical work or decisions. Able to disagree and commit. |"
  },
  {
    "source": "titles-for-ops.md",
    "content": "Titles for Programmers Programming Management On Web and SIP programming teams, Lead Programmers (L4) and Principal Programmers (L5) act as tech leads to Junior - Senior Programmers (L1-3). All Leads and Principals report directly to our CTO. Tech leads are responsible for:\n- Reviewing a report's substantial PRs before they're shipped.\n- Having a kick-off conversation with a report on every substantial project.\n- Reviewing a report's on-call work and handoff after every shift.\n- Providing People Ops with the key input to annual performance reviews.\n- Identifying and escalating slips in performance or process to People Ops."
  },
  {
    "source": "titles-for-ops.md",
    "content": "A tech lead on the SIP team also acts as SIP Coordinator. They're responsible for setting cycle priorities, liaising with other project teams, and maintaining general oversight of team resources. Our Mobile programming teams (iOS and Android) have 1 manager overseeing both teams who is responsible for technical leadership and people management. Individual Contributor Expectations"
  },
  {
    "source": "titles-for-ops.md",
    "content": "| Category | Junior Programmer (L1) | Programmer (L2) | Senior Programmer (L3) | Lead Programmer (L4) | Principal Programmer (L5) |\n| ----- | ----- | ----- | ----- | ----- | ----- |\n| **Skill** |  |  |  |  |  |\n| *Mastery* | Proficient in basic language and framework features, but some advanced structures or features may still be unfamiliar. Occasional issues following patterns and approaches within existing code bases. | Follows established patterns and approaches within existing code bases with ease. Writes code that is considered high quality by colleagues. Effectively and artfully applies domain design skills in normal course of work. | Capable of devising new patterns and conventions within existing code bases and in greenfield development. Code remains accurate, reliable, and maintainable even when faced with challenging or complicated problems. | Acts as a subject matter expert on multiple systems. Makes strategic decisions around major components. | Invents new concepts, creates new systems, pushes the whole organization or industry forward regularly. |\n| *Scope* | Capable of working on tightly-scoped, routine problems. | Capable of working on clearly defined and scoped individual features or problems. | Capable of taking substantial features from concept to shipping as the sole programmer (alongside a designer on the product side). | Capable of owning and running entire subsystems of work (Queenbee expert, Action Cable implementation). Strong track record of introducing significant improvements in system quality, performance, or scalability. | Can set the strategic direction of an entire discipline, such as security, web or mobile. Consistently works on projects with high complexity. Would be the go-to person for advice on the most technically challenging problems. |\n| *Judgment* | Demonstrates curiosity in their craft, prioritizes their own development to better serve their team. Researches what's been done in the past and why, attempts to solve problems independently. | Proactively identifies and resolves problems, improves areas of the code they work on, and leaves things in better shape than they found them. Pays attention to detail. | Has accumulated sufficient experience to be consistently sought by peers, across multiple teams, for advice. Improves existing professional standards for the team. | Has the experience, trust and respect to operate at the tech lead level. Defines professional standards. Is sought for advice across disciplines. | Is seen as a leader across teams, technically and culturally. Capable of setting and directing across an entire discipline, such as SIP, Web or Mobile. Is known company-wide as a go-to expert for advice on critical work across disciplines. |\n| *Tooling* | Has a rudimentary understanding of our tools (AppSignal, Buildkite, Kibana, Dash, Trek, Post Office etc). | Uses our most common tools in day to day work to help diagnose issues, optimize performance. | Demonstrates a comprehensive understanding of all our tools. Uses them regularly to diagnose issues quickly and calmly, even under pressure. | An expert in our tools. Extends and improves them over time. Can identify where tooling should be improved and oversee implementation. | Invents novel tools with strategic impact. Can objectively rationalise whether to build or buy, balancing tradeoffs with business strategy in mind. |\n| **Engagement** |  |  |  |  |  |\n| *Ownership* | Participates in programmer on-call rotation under guidance from more senior programmers, but delivering simpler resolutions end-to-end. | Participates in programmer on-call shifts with guidance from a more senior team member. Capable of handling or triaging production issues across multiple systems with minimal assistance. Can be relied upon to lead the resolution of bugs or minor incidents related to their work or area of expertise. | Can recognize and raise major incidents and lead the response from inception to resolution. | Can lead the resolution of any engineering problem in their discipline. Is a significant technical contributor to problem resolution; demonstrates consistent maturity in communication and demeanor under stress. | Fully capable of leading the most critical production incidents to successful resolution, coordinating company-wide responses and advising on public communications. |\n| *Communication* | Proactively communicates what they are working on, attempts to unblock themselves but asks for help when needed. Questions mostly don't repeat. | Presents pull requests that demonstrates competency with our patterns and principles, but may require oversight from senior peers. Questions to more senior coworkers are thoroughly researched and presented before posed. | Trusted to provide actionable feedback across team pull requests in line with our principles that requires little or no oversight. Provides technical advice and suggestions during planning/scoping. | Provides critical, actionable feedback on pull requests which ensures quality and consistency is upheld across the team. Demonstrates project management best practices. Ensures leadership is informed on team progress. Writes Heartbeats and Kickoffs. | Demonstrates long-term strategic thinking, working with leadership to communicate our engineering vision across teams and disciplines. |\n| *Planning* | Prioritizes daily work against team/project needs with regular guidance. Demonstrates good time management. | Prioritizes tasks and project work with little direction. Works confidently and effectively, persists when faced with uncertainty or ambiguity but pulls in support when needed. Identifies judo opportunities. Contributes more broadly to cycle planning within the team. | Requires no direction to effectively manage their time, finds valuable and productive tasks to work on without prodding, and helps steer cycle planning. Identifies judo opportunities in their own work and for others. Fosters collaboration across teams. | Can plan entire cycles for a team. Can drive the agenda, hammer scope, offer critical insight from extensive experience. Regularly challenges their team or discipline to help drive projects forward, to better deliver on team/discipline priorities. | Capable of running and directing larger teams for multiple cycles, and for large, long-running projects. Elevates team and company standards through developing new tooling, processes, procedures, and highly effective communication. Carries out research, testing, implementation and improvement for new systems. Pushes the whole organization forward regularly through implementing new systems and designs. |\n| *Trust* | Work is thoroughly reviewed with substantial back and forth frequently needed before merging. Reads pull requests. Makes minor contributions to the improvement of system documentation. | Work is reviewed with some back and forth and the occasional need for material direction or implementation changes. Trusted to review non-critical pull requests to clarify style, readability, performance issues. Makes material contributions to documentation: features, procedures, runbooks. | Work doesn’t necessarily need to be reviewed, but general approach may be. Trusted to review critical or full-batch pull requests, course- corrects when required. Provides context and clarity to the engineering organization by producing and maintaining documentation / runbooks / pitches. | Major projects can be completed independently and shipped without review. Provides developing oversight to senior, mid, and juniors. Expected to review complex and high-impact pull requests across teams. Defines and maintains departmental standards by developing processes and procedures, writing style guides, recording internal screencasts. | Entire systems can be designed, developed, and shipped without the need for review. Provides developing oversight to everyone else in organization. Expected to review system architecture across multiple product suites to oversee work is produced to the highest technical standards. A leader in ensuring robust and effective best practices are understood and followed across the engineering organization. |\n| **Coachability** |  |  |  |  |  |\n| *Feedback* | Observes and learns from the work and behavior of others. Receives constructive feedback with a growth mindset. | Receives constructive feedback with a growth mindset. Provides specific, well-considered feedback within area of expertise, when asked. Is able to disagree and commit. | Can provide specific, material, constructive feedback on the work of junior-mid programmers that deepens their knowledge across broad areas. Is able to disagree and commit. | Is a formal mentor to programmers, providing specific, material, constructive feedback on work. Capable of being a technical lead on small teams. Consistently sought by colleagues for assistance with critical work or decisions. Is able to disagree and commit. | Is a formal mentor to programmers, providing specific, material, constructive feedback on work. Defines engineering-wide standards and guidance. Fully capable of leading teams of any size over an entire discipline. Consistently sought by colleagues across the organization for assistance with critical work or decisions. Is able to disagree and commit. |"
  },
  {
    "source": "titles-for-programmers.md",
    "content": "Titles for Customer Support"
  },
  {
    "source": "titles-for-programmers.md",
    "content": "| Category | Junior Customer Support Rep (L1) | Customer Support Rep (L2) | Senior Customer Support Rep (L3) | Lead Customer Support Rep (L4) | Principal Customer Support Rep (L5) |\n| ----- | ----- | ----- | ----- | ----- | ----- |\n| **Skill** |  |  |  |  |  |\n| *Technical* | Communicates basic product knowledge to customers well and with enthusiasm. | Confident in product knowledge and well versed in one product. Communicates knowledge to customers well and with enthusiasm, and able to adapt messaging to the situation. | Proficient in one or more products. Communicates knowledge to customers well and with enthusiasm, and able to adapt messaging to the situation. | Proficient in multiple products. Communicates knowledge to customers well and with enthusiasm, and able to adapt messaging to the situation. | Expert in multiple products. Communicates knowledge to customers well and with enthusiasm, and able to adapt messaging to the situation. |\n| *Technical* | Customer emails adhere to the style guide with occasional need for redirection. Able to work independently on routine emails, and doesn't need help answering commonly asked questions. | Customer emails adhere to the style guide with little need for redirection. Able to work independently on all emails or calls. | Customer emails adhere to the style guide with no need for redirection.Able to work independently on all emails or calls, and doesn't need help answering questions. | Customer emails adhere to the style guide, and contributes to the style guide and snippets repo. Able to work independently on all emails and calls, and can handle difficult cases and frustrated customers. | Customer emails adhere to the style guide, and contributes to the style guide and snippets repo. Able to work independently on all emails and calls, and can handle the most difficult cases and frustrated customers. |\n| *Tech and Tooling* | Demonstrated good technical understanding of most of the software systems and tools needed in daily work. Technical knowledge of the products is limited and developing. | Demonstrated technical understanding of the software systems and tools used in your daily work. Good technical understanding of one product. | Able to diagnose and escalate low-level technical issues appropriately. Good technical understanding of all products. | Able to diagnose and escalate most technical issue appropriately. Capable of correcting low-level customer technical issues independently, with support from on-call. | Able to diagnose and escalate all technical issues appropriately. Capable of correcting many customer technical issues independently. |\n| *Scope* | Works primarily on customer communication; no project work or limited involvement. | Participates in project work with oversight from a senior teammate. | Works independently on small projects and are a reliable contributor to larger projects. | Elevates team and company standards through developing new processes, procedures, and effective communication. Major contributor on special project work. | Capable of conceptualizing and executing large special projects and working with a team to complete them. |\n| *Judgment* | Capable of managing individual to-dos. Pitches in on project work when asked, with oversight. | Manages daily workflow and to-dos without oversight. | Manages daily workflow and special projects with minimal oversight or approval. Good sense for when to cut scope to deliver projects on time, within appetite. | Strong ability to set scope and manage large ongoing projects with minimal oversight or approval. Sought out for advice by teammates and outside the team. | A leader in ensuring robust and effective best practices are understood and followed across the team and organization. Has a wide range of focus and finds opportunities to make improvements to work, without it being assigned. |\n| **Engagement** |  |  |  |  |  |\n| *Ownership - Manager of One* | Manages the individual steps to arrive to solutions once assigned work. | Sets their own direction once assigned work. Asks questions but does not need status checks outside of email reviews. | Sets their own direction and works with little to no oversight or help. Conceptualizes new work to be done, steps to get there, and then executes the steps to complete it. | Capable of setting small team direction. Manages projects and resources, requiring little to no redirection or input from leadership. | Capable of setting team direction. Manages projects and resources, requiring little to no redirection or input from leadership. |\n| *Communication* | Communicates well on team calls and in Basecamp check-ins. Asks questions of more senior teammates after doing research to find answers. | Attempts to unblock themselves but asks for help when needed. Communicates well within the team structure, sharing knowledge and bringing in more experienced teammates when needed. | Attempts to unblock themselves but ask for help when needed. Communicates well within the team structure, sharing knowledge and bringing in more experienced teammates when needed. | Acts as a representative to the company, weighing in on larger discussions and making recommendations. Rarely need help unblocking themselves, and acts as a resource for others. | Demonstrate project management and communication best practices. Ensures leadership is informed on team progress. |\n| *Planning* | Able to plan individual daily tasks with little feedback or oversight. Able to call attention to opportunities for small improvements to projects and product. | Able to plan individual daily tasks with minimal oversight. Routinely calls attention to opportunities for small improvements to projects and product. | Plans individual projects effectively with little oversight. Contributes to cycle planning. Identifies work without having it assigned and without asking others what's important. Able to pitch projects to the team and explain why it's important and should be prioritized. | Key contributor to cycle planning. Able to plan and execute large projects. | Able to plan and execute large projects while keeping team and company strategy in mind. |\n| *Flexibility* | Has some points of view about technical solutions and best practices, but mostly observes and learns from the more senior members of your team. | Demonstrated willingness to express a viewpoint and opinion, and able to disagree and commit. | Demonstrated strong points of view about technical approaches and solutions that are rooted in experience. Willing to express a viewpoint and opinion, and also able to disagree and commit. | Strong points of view rooted in experience, technical expertise, and industry best practices. Expresses opinions confidently and effectively, and can balance recommendations with the larger needs of the team. | Demonstrated ability to think through problems and devise and apply novel solutions that are outside the box. |\n| *Trust* | Work is reviewed, and mistakes in quality and general approach do not repeat often. | Productive member of the team, able to contribute effectively to small projects. Work is reviewed with the occasional need for edits. | Fully productive member of the team, able to contribute to almost any project. Work doesn’t necessarily need to be reviewed, but general approach may be. | Able to contribute to any project and able to resolve almost any customer interaction. Work happens autonomously with no regular need for review. Work is almost always free of mistakes, and often helps others improve the quality of their work. | Significant contributor to problem resolution and code resolution; demonstrate consistent maturity and leadership. |\n| **Coachability** |  |  |  |  |  |\n| *Feedback* | Actively seeks feedback. Receives feedback with a positive attitude, and applies corrective feedback well. Hungry for growth & development. | Able to weigh in on larger discussions at the team level with helpful, relevant feedback. Receives feedback with a growth mindset. | Able to act as informal mentor, and provides helpful, direct, specific feedback to more junior teammates. | Sought by colleagues on and off the team for help with critical work or decisions. | A leader on the team. Sought by colleagues on and off the team for help with critical work or decisions. |"
  },
  {
    "source": "titles-for-programmers.md",
    "content": "Titles for Customer Support Leadership \n| Category | Customer Support Manager (M1) | Senior Customer Support Manager (M2) | Head of Customer Support (M3) |\n| ----- | ----- | ----- | ----- |\n| **Skill** |  |  |  | \n| *Mastery* | Makes meaningful contribututions to developing team service standards and requirements. Communicates service standards and requirements reliably and effectively to reports. | Defines and documents team service standards and requirements with approval from Head of Support. | Successfully supervises representatives that are answering customer inquiries over the phone and email. Through training and oversight, ensures customers have a positive, thorough, and consistent experience when contacting the company. |\n| *Mastery* | Maintains regular, productive communication with cohorts of 2-4 Reps. Acts as a coach and a resource for reports for improving their customer service skills & comms style, technical troubleshooting, and project advancement. | Maintains regular, productive communication with cohorts of 5+ Reps. Acts as a coach and a resource for reports for improving their customer service skills & comms style, technical troubleshooting, and project advancement. | Establishes and maintains effective mechanisms for gathering and measuring customer satisfaction, team efficiency, and team performance and sharing data in a useful way to internal stakeholders, executive leadership, and product development. |\n| *Mastery* | Oversees performance management for team of 2-4 reps. Runs 3/6/12 performance reviews, administers PIPs recommended by leadership, performs terminations recommended by leadership, onboards & trains new hires, recommends promotions, and effectively manages job performance lags. | Oversees performance management for team of 5+ reps. Runs 3/6/12 performance reviews, recommends and administers PIPs, recommends and performs terminations, onboards & trains new hires, recommends promotions, and effectively manages job performance lags. | Oversees performance management for CS Managers. Assists Managers with administering PIPs, performing terminations, onboarding & training new hires, recommending promotions, and managing performance lags. Able to act as ultimate authority for all team performance management and make accurate judgment calls that reflect the needs of the team & company. |\n| *Mastery* | Capable of shaping, pitching, and executing support projects that add value to team skills and tooling, team/company processes, and customer experience. | Capable of shaping, pitching, and executing large-scale, far-reaching support projects that add value to team skills and tooling, team/company processes, and customer experience. | Approves and maintains oversight and controls over Support projects that add value to team skills and tooling, team/company processes, and customer experience. |\n| *Tech and Tooling* | An expert in all existing software systems and tools needed in CS work. Can identify where existing tooling should be improved, proposes solutions, and oversees implementation. | Recommends, implements, and uses tech and tooling that provide meaningful insights into team performance and processes. | Proficient in Support stack, and uses technology appropriately to provide meaningful insights and to make recommendations. Makes informed, thoughtful decisions about new tools & services and communicates those to team/executive team as needed. |\n| *Scope* | Capable of devising and running cycle projects, taking them from concept to completion with minimal review or guidance. Strong track record of introducing significant improvements in CS systems. | Capable of running long term projects that substantially impact departments outside of Support. Manages critical work without oversight or approval. | Oversees all team project work with support from Managers. Able to act as ultimate authority on project management and able to make accurate judgment calls about project direction and goals that reflect the needs of the team & company. |\n| *Judgment* | Has accumulated sufficient experience to be consistently sought by peers, across teams, for advice. Improves existing professional standards for the team. Demonstrates curiosity, prioritizes work to serve the best interests of the team. Leaves documentation in a better place than they found it. | Defines professional standards for the team. Prioritizes work to serve the best interests of the company. | Has a wide range of focus and finds opportunities to make substantial improvements to the Support environment and how Support interfaces & influences other departments. Has a good sense for when and how to cut scope or change direction to deliver work on time and can communicate that effectively to Managers. |\n| **Engagement** |  |  |  | \n| *Ownership / Manager of One* | Conceptualizes new work to be done, and is executes the steps to complete it successfully. Independently explores areas in their work area that could use improvement. | Conceptualizes projects that address gaps in company's Support footprint. Able to devise & execute steps to form & complete the project, with guidance. | Fully capable of leading the most complex projects from inception to completion, coordinating multiple teams or external contractors independently. |\n| *Communication* | Attempts to unblock themselves but ask for help when needed. Communicates well in Basecamp check-ins, team calls, and within the team structure. Shares knowledge and acts as a resource for others. Communication happens reliably in the open, in Basecamp. | Acts as a representative to other teams, weighing in on larger discussions and making recommendations. Rarely needs help unblocking themselves. | Acts in a leadership capacity to the company, weighing in on larger discussions and making recommendations. Trusted advisor for everyone at the company in matters of Support and leadership. Demonstrates project management and communication best practices. Ensures leadership is informed on team progress. Responsible for cycle planning. |\n| *Flexibility* | Has strong points of view about leadership & technical approaches/solutions that are based in their own experience. Willing to express a viewpoint and opinion, and also able to disagree and commit. | Makes tactical & strategic recommendations based in experience & industry best practices, and can balance recommendations with the larger needs of the team and company. | Strong points of view rooted in experience, expertise, and industry best practices. Expresses opinions confidently and effectively, and always considers the needs of the company when making recommendations. |\n| *Trust* | Work doesn’t necessarily need to be reviewed, but general approach may be. | Work happens autonomously without check-ins or regular need for review. | Trusted to run the entire CS team with support from M1- 2 Managers. No day-to-day oversight, occasional strategic redirection from Sr. Leadership. Work happens autonomously with no need for status checks. Work is almost always free of mistakes. |\n| **Coachability** |  |  |  | \n| *Feedback* | Receives feedback with a positive attitude and applies corrective feedback well. Identifies areas for personal growth & development. | Can provide specific and constructive feedback on the work of others and to teammates. Reliably and judiciously incorporates feedback from leadership. | Sought by colleagues on and off the team for help with project work or decision making and professional guidance. |"
  },
  {
    "source": "titles-for-QA.md",
    "content": "Titles for Designers"
  },
  {
    "source": "titles-for-QA.md",
    "content": "| Category | Designer (L2) | Senior Designer (L3) | Lead Designer (L4) | Principal Designer (L5) |\n| ----- | ----- | ----- | ----- | ----- |\n| **Skill** |  |  |  |  |\n| *Technical* | Your design sensibilities align with the 37signals brand and guiding principles but occasionally need some correcting from more senior designers. | Your design sensibilities align with the 37signals brand and guiding principles. | Your design sensibilities align with the 37signals brand and guiding principles. You're an inventor of novel and unique designs, flows, and experiences. | Your design sensibilities align with the 37signals brand and guiding principles. You're able to make major contributions to the look and feel of products, invent brand new product designs, and extend and improve upon our brand and principles. |\n| *Technical* | You're able to write modern HTML/CSS or Javascript. You lack direct experience with Rails, but are comfortable working in the codebase, applying your designs and interactions to implemented code with oversight and feedback. | WEB: You're proficient in writing modern HTML/CSS and Javascript. You're comfortable working in the Rails codebase, applying your designs and interactions to implemented code. / MOBILE: You're updating views in the web apps so they display correctly in the native apps. You're supporting design code and assets in the native apps. | WEB: You're proficient in modern HTML/CSS and write clear Javascript using Stimulus. You are comfortable in the Rails codebase, able to stub basic flows and wire-up views. You contribute to improving internal design processes, conventions and techniques. / MOBILE: You're building new sections and features of the apps alongside programmers. You understand the technical constraints of the codebase, and contribute design that can push those constraints. You contribute to improving internal design processes, conventions and techniques. | WEB: You're proficient in modern HTML/CSS/JS/Rails. You can work comfortably in the codebase at any level of the stack and can intelligently discuss complex application logic with a programmer. You regularly publish and share design process insights inside and outside the company. You move the industry forward by introducing novel techniques, approaches, or ideas. |\n| *Technical* | Your writing is excellent. You can find the sweet spot between expressive, clear, and brief with guidance and proofreading. You're able to adapt copy to match the tone and voice of our products. | Your writing is excellent. You can find the sweet spot between expressive, clear, and brief with no guidance, but may need light editing. You're able to adapt copy to match the tone and voice of our products. | Your writing is excellent. You can find the sweet spot between expressive, clear, and brief without guidance. You're able to write fluently in the tone and voice of our products. | Your writing is exceptional. You can find the sweet spot between expressive, clear, and brief. You're fluent in the tone and voice for our products and can invent, improve upon, and extend the house style. |\n| *Tooling* | You have demonstrated a good technical understanding of the software systems and tools needed in your daily work. | You have demonstrated a good technical understanding of the software systems and tools needed in your daily work. | You have a proficient technical understanding of the software systems and tools needed in your daily work. You're adept with modern tools, techniques, and systems and know when to employ them in your own work. | You have demonstrated a excellent technical understanding of the software systems and tools needed in your daily work. You're adept with modern tools, techniques, and systems, know when to employ them in your own work, and introduce new tools and systems to the team. |\n| *Scope* | You can run point on small-batch projects (2-weeks), taking them from concept to shipping alongside a programmer. Your work requires minimal review or guidance. | You successfully run point on small-batch projects (2-weeks), taking them from concept to shipping alongside a programmer. You require only minimal review or guidance. | You successfully run point on big-batch projects (4-6 weeks), taking them from concept to shipping alongside a programmer. You work autonomously without regular need for review. | You successfully run point on our most complex, critical, big-batch projects (including new products and major product redesigns), taking them from concept to shipping as the sole designer (alongside one or more programmers). |\n| *Judgment* | You can set scope and manage small projects with minimal oversight or approval. You may need help determining how and when to cut scope. | You can set scope and manage your projects with minimal oversight or approval. You have a good sense for when to cut scope to deliver projects on time, within appetite. | You have a strong ability to set scope and manage big-batch projects with minimal oversight or approval. You know when to make cuts to deliver tight, effective features that fit appetite and ship on-time. | You demonstrate exceptional ability to set scope and manage even the most complex projects without oversight or approval. You know when to make cuts to deliver tight, effective features that fit appetite and ship on-time. |\n| *Judgment* | You are developing a wide range of focus and find opportunities to make improvements to your work as you go. You look for the opportunity to make small improvements to product (quick wins). | You have a wide range of focus and find opportunities to make improvements to your work as you go. You've made small improvements to product (quick wins). | You have a wide range of focus and find opportunities to make improvements to your work as you go. You've made small improvements (quick wins) to the product. | You have a wide range of focus and find opportunities to make improvements to your work as you go. If you see something to improve, you do it; you don't wait for it to be assigned to you. |\n| *Leadership* |  | You provide guidance to other designers, as well as people outside of your team. You're a mentor to newer designers on the team. You can work with anyone. You navigate difficult situations directly and with ease. | You're a mentor and coach, and you provide useful & constructive feedback to your team. You help define performance standards. You're fully capable of leading small teams of 1-2. People outside your team seek your guidance. You're a leader on your team, technically and culturally. You can work with anyone and navigate difficult situations directly and with ease. | You're a mentor and coach, and you provide useful & constructive feedback to your team. You help define performance standards. You're fully capable of leading large teams of 3+. People outside your team seek your guidance. You're a leader at the company, technically and culturally. You're a consummate team player able to contribute across teams, work with anyone, and navigate difficult situations directly and with ease. |\n| **Engagement** |  |  |  |  |\n| *Ownership - Manager of One*| You set your own direction once assigned work. You ask questions when you need help. | You set your own direction once assigned work. You ask questions when you need help, but you don't need daily status checks. | You set your own direction and work with little to no oversight or help. You can conceptualize new work to be done, steps to get there, and execute the steps to complete it. | You set your own direction and work with little to no oversight or help. You can conceptualize new work to be done, steps to get there, and execute the steps to complete it. |\n| *Communication* | You communicate what you're working on in team calls and Basecamp check-ins. You may contribute to heartbeats and kick-offs. | You contribute to heartbeats and kick-offs. You communicate feature releases internally. | You're a key contributor to heartbeats, kickoffs, and both internal and external feature releases. | You run point on team and product announcements, pushing high quality and informative announcements internally and to the public and fielding questions.\n| *Trust* | Your day-to-day work doesn't need to be reviewed. Your overall approach and your project management approach may require guidance. | Your day-to-day work doesn't need to be reviewed. Your project management approach may require guidance. | Work happens autonomously without regular need for review. | Work happens autonomously with no need for review. |\n| *Flexibility* | You have a point of view as a designer and you're demonstrated comfort expressing it. You're able to disagree and commit. | You have a point of view as a designer and you're demonstrated comfort expressing it. You're able to disagree and commit. | You have a strong point of view, but you've shown you're able to edit and be flexible. | You have a strong point of view, but you've shown you're able to edit and be flexible. |\n| **Coachability** |  |  |  |  |\n| *Feedback* | You observe and learn from the work and behavior of others. You receive constructive feedback with a growth mindset. | You receive constructive feedback with a growth mindset. You provide specific, thoughtful feedback within area of expertise when asked. | You can provide specific, material, constructive feedback on the work of more junior designers that deepens their knowledge across broad areas. | You define team standards and guidance. You're consistently sought by colleagues across the company for assistance with critical work or decisions. |"
  }
]